cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed'
# Install a modern version of Bash.
brew 'bash'
brew 'bash-completion@2'

# Install `wget` with IRI support.
brew 'wget'

# Install GnuPG to enable PGP-signing commits.
brew 'gnupg'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
# Disabled b/c brew-installed OpenSSH does not play nicely with macOS Keychain + SSH
# brew 'openssh'
brew 'screen'
brew 'php'
brew 'gmp'

# Install font tools.
# tap 'bramstein/webfonttools'
# brew 'sfnt2woff'
# brew 'sfnt2woff-zopfli'
# brew 'woff2'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew 'aircrack-ng'
# brew 'bfg'
# brew 'binutils'
# brew 'binwalk'
# brew 'cifer'
# brew 'dex2jar'
# brew 'dns2tcp'
# brew 'fcrackzip'
# brew 'foremost'
# brew 'hashpump'
# brew 'hydra'
# brew 'john'
# brew 'knock'
# brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
# brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
# brew 'ucspi-tcp' # `tcpserver` etc.
# brew 'xpdf'
brew 'xz'

# Install other useful binaries.
brew 'ack'
# brew 'exiv2'
brew 'git'
brew 'git-lfs'
brew 'gs'
# brew 'imagemagick'
# brew 'lua'
# brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'rlwrap'
brew 'ssh-copy-id'
brew 'tree'
brew 'vbindiff'
brew 'zopfli'

# Jeff Byrnes additions from Mathias Bynens’ upstreams

# Handy git additions
brew 'git-extras'
brew 'hub'

# Install Generic Colouriser
brew 'grc'

# Replace system cURL with an updated one
brew 'curl'

# Install HTTPie, a better cURL
brew 'httpie'

# Install yet more useful binaries.
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'ripgrep'
brew 'testssl'

# Install the LESS CSS precompiler
brew 'less'
brew 'libiconv'
brew 'zlib'

# cat, with color
brew 'ccat'

# syntax highlighting cat replacement
brew 'bat'

# Additional PHP tools
brew 'composer'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phplint'
brew 'phpmd'
brew 'phpunit'

# Install Hack typeface
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-source-code-pro'

# Install bash completions
brew 'apm-bash-completion'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'docker-completion'
brew 'gem-completion'
brew 'kitchen-completion'
brew 'rake-completion'
brew 'vagrant-completion'

# Install tldr for more friendly manpages
tap 'tldr-pages/tldr'
brew 'tldr-pages/tldr/tldr'

# GPG agent for signing commits
brew 'pinentry-mac'

brew 'icu4c'
brew 'boost'

brew 'diff-so-fancy'
brew 'go'

tap 'heroku/brew'
brew 'heroku/brew/heroku'

brew 'man2html'

brew 'node'
brew 'yarn'

brew 'python3'

# Install rbenv for multiple Ruby versions
brew 'ruby-build'
brew 'rbenv'

brew 'reattach-to-user-namespace'

brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmux'

brew 'watch'

brew 'aws-shell'

# Linter for bash scripts
brew 'shellcheck'

# Linter for Dockerfiles
brew 'hadolint'

# Linter for prose
brew 'proselint'

# Linter for YAML
brew 'yamllint'

# Terraform things
brew 'terraform'
brew 'terragrunt'
brew 'terraforming'
brew 'terraform_landscape'

# Linter for Terraform configs
tap 'wata727/tflint'
brew 'wata727/tflint/tflint'

# Useful Quicklook additions
cask 'betterzip'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'webpquicklook'

# Install Dart Sass
tap 'sass/sass'
brew 'sass/sass/sass'

# Useful macOS apps
cask 'keepingyouawake'
cask 'keybase'
cask 'macdown'
cask 'suspicious-package'
cask 'yakyak'

# CLI for Mac App Store
brew 'mas'

mas 'Acorn', id: 1233861775
mas 'Canopy', id: 1419224245
mas 'Capo', id: 696977615
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Discovery', id: 1381004916
mas 'Evernote', id: 406056744
mas 'Fantastical 2', id: 975937182
mas 'GarageBand', id: 682658836
mas 'Growl', id: 467939042
mas 'Helium', id: 1054607607
mas 'iFlicks', id: 408937559
mas 'iMovie', id: 408981434
mas 'iReal Pro', id: 409035833
mas 'Keynote', id: 409183694
mas 'LookUp', id: 965041401
mas 'Medis', id: 1063631769
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Patterns', id: 429449079
mas 'Reeder', id: 880001334
mas 'Silicio', id: 933627574
# mas 'Slack', id: 803453959
mas 'Soulver', id: 413965349
mas 'Spark', id: 1176895641
mas 'Trello', id: 1278508951
mas 'Tweetbot', id: 1384080005
