cask_args appdir: '/Applications'

# Start with git
brew 'git'
brew 'git-extras'

brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
# Install Bash 4.
brew 'bash'
brew 'bash-completion@2'

# Install Generic Colouriser
brew 'grc'

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'vim', args: ['with-override-system-vi']
brew 'curl'

# Install HTTPie, a better cURL
brew 'httpie'

brew 'grep'
brew 'screen'
brew 'grep'
brew 'less'
brew 'libiconv'
brew 'screen'
brew 'zlib'

# cat, with color
brew 'ccat'

# syntax highlighting cat replacement
brew 'bat'

brew 'php'
brew 'composer'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phplint'
brew 'phpmd'
brew 'phpunit'

# Install other useful binaries.
brew 'ack'
brew 'fd'
brew 'fzf'
brew 'git-lfs'
brew 'hub'
brew 'jq'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'

# Install Hack typeface
tap 'caskroom/fonts'
cask 'caskroom/fonts/font-hack'

# Install bash completions
brew 'apm-bash-completion'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'docker-completion'
brew 'gem-completion'
brew 'kitchen-completion'
brew 'rake-completion'
brew 'vagrant-completion'

# Install tldr for more friendly manpages
tap 'tldr-pages/tldr'
brew 'tldr-pages/tldr/tldr'

# Useful apps
cask 'keepingyouawake'
cask 'keybase'
cask 'macdown'
cask 'suspicious-package'
cask 'yakyak'

# GPG agent for signing commits
brew 'pinentry-mac'

brew 'icu4c'
brew 'boost', args: ['with-icu4c']

brew 'diff-so-fancy'
brew 'go'
brew 'gnupg'
brew 'heroku-toolbelt'
brew 'man2html'
brew 'node'
brew 'yarn'

brew 'python3'
brew 'ruby-build'
brew 'rbenv'

brew 'reattach-to-user-namespace'

brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmux'

brew 'watch'

brew 'aws-shell'

# Linter for bash scripts
brew 'shellcheck'

# Linter for Dockerfiles
brew 'hadolint'

# Terraform things
brew 'terraform'
brew 'terragrunt'
brew 'terraforming'
brew 'terraform_landscape'

# Linter for Terraform configs
tap 'wata727/tflint'
brew 'wata727/tflint/tflint'

# Useful Quicklook additions
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# Install Dart Sass
brew 'sass/sass/sass'

# CLI for Mac App Store
brew 'mas'

mas '1Password', id: 443987910
mas 'Acorn', id: 634108295
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Evernote', id: 406056744
mas 'Growl', id: 467939042
mas 'LookUp', id: 965041401
mas 'Medis', id: 1063631769
mas 'Patterns', id: 429449079
mas 'Reeder', id: 880001334
mas 'Silicio', id: 933627574
mas 'Soulver', id: 413965349
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Trello', id: 1278508951
mas 'Tweetbot', id: 557168941
