cask_args appdir: '/Applications'

# Start with git
brew 'git'

brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
# Install Bash 4.
brew 'bash'
brew 'bash-completion@2'

# Install Generic Colouriser
brew 'grc'

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'vim', args: ['with-override-system-vi']
brew 'curl'

brew 'grep'
brew 'openssh'
brew 'screen'
brew 'grep'
brew 'less'
brew 'libiconv'
brew 'openssh'
brew 'screen'
brew 'zlib'

tap 'homebrew/php'
brew 'homebrew/php/php71'
brew 'homebrew/php/php71-mcrypt'
brew 'homebrew/php/composer'
brew 'homebrew/php/php-code-sniffer'
brew 'homebrew/php/php-cs-fixer'
brew 'homebrew/php/phplint'
brew 'homebrew/php/phpmd'
brew 'homebrew/php/phpunit'

# Install other useful binaries.
brew 'ack'
brew 'git-lfs'
brew 'hub'
brew 'jq'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'

# Install Hack typeface
tap 'caskroom/fonts'
cask 'font-hack'

# Install bash completions
brew 'apm-bash-completion'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'docker-completion'
brew 'gem-completion'
brew 'kitchen-completion'
brew 'rake-completion'
brew 'vagrant-completion'

# Install tldr for more friendly manpages
tap 'tldr-pages/tldr'
brew 'tldr-pages/tldr/tldr'

# Useful apps
cask 'macdown'

# GPG agent for signing commits
brew 'gpg-agent'
brew 'pinentry-mac'

brew 'icu4c'
brew 'boost', args: ['with-icu4c']

brew 'diff-so-fancy'
brew 'go'
brew 'gnupg'
brew 'heroku-toolbelt'
brew 'man2html'
brew 'node'

brew 'python'
brew 'python3'
brew 'ruby-build'
brew 'rbenv'

brew 'reattach-to-user-namespace'
brew 'siege'

brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmate'
brew 'tmux'

brew 'watch'

# Linter for bash scripts
brew 'shellcheck'

# Useful Quicklook additions
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'webpquicklook'
cask 'suspicious-package'
