cask_args appdir: '/Applications'

brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
# Install Bash 4.
brew 'bash'
tap 'homebrew/versions'
brew 'bash-completion2'

# Install Generic Colouriser
brew 'grc'

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/php/php56', args: ['with-gmp']

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'git-lfs'
brew 'imagemagick', args: ['with-webp']
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'
