cask_args appdir: '/Applications'

brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
# Install Bash 4.
brew 'bash'
tap 'homebrew/versions'
brew 'homebrew/versions/bash-completion2'

# Install Generic Colouriser
brew 'grc'

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'vim', args: ['override-system-vi']
brew 'curl'

tap 'homebrew/dupes'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/dupes/apple-gcc42'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/libiconv'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'homebrew/dupes/zlib'

tap 'homebrew/php'
brew 'homebrew/php/php56', args: ['with-gmp']
brew 'homebrew/php/composer'
brew 'homebrew/php/php-code-sniffer'
brew 'homebrew/php/php-cs-fixer'
brew 'homebrew/php/php56-mcrypt'
brew 'homebrew/php/phplint'
brew 'homebrew/php/phpmd'
brew 'homebrew/php/phpunit'

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'testssl'
brew 'tree'

# Install Hack typeface
tap 'caskroom/fonts'
cask 'font-hack'

# Install bash completions
tap 'homebrew/completions'
brew 'homebrew/completions/apm-bash-completion'
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/completions/bundler-completion'
brew 'homebrew/completions/docker-completion'
brew 'homebrew/completions/docker-machine-completion'
brew 'homebrew/completions/gem-completion'
brew 'homebrew/completions/kitchen-completion'
brew 'homebrew/completions/rake-completion'
brew 'homebrew/completions/vagrant-completion'

# Install VIPS for Windlass
tap 'homebrew/science'
brew 'homebrew/science/vips'

# Install tldr for more friendly manpages
tap 'tldr-pages/tldr'
brew 'tldr-pages/tldr/tldr'

# Useful apps
cask 'atom'
cask 'macdown'
cask 'panic-unison'
